{"itemList": [{"productId": 1, "type": "floor", "items": [{"_comment": "REMOVED: Bologna (ID 1) - References deleted T02BL texture files (T02BL_1.png through T02BL_7.png) that were deleted during asset optimization cleanup. These ~161MB of T-series texture files were removed to improve build times. Original Bologna floor data preserved for potential restoration when textures are re-added.", "id": 1, "name": "[TEMPORARILY DISABLED] Bologna", "description": "TEMPORARILY DISABLED: This floor item references deleted T02BL texture files that were removed during asset optimization to improve build times. Original description: The story of darkness has an interesting twist, as the baggy windbreaker swirls in the alley, the world converges in the strong aroma of morning coffee. The smell spreads and diffuses, wordless but fascinating. With coffee-like deep brown under our feet, the kitten's body is unseen, but its bright eyes still shine through. The coloring process of this type of flooring is unique, using the reactive stain coloring technique, wood's natural colors and grains react differently to the water-based environment-friendly chemicals, such color variations represent wood's natural characteristics. The water-based UV Lacquer coating type provides great protection to the wood planks, it not only prevents the permeating of water moisture but is also more durable and environment-friendly.", "thumbnailUrl": "T02BL_thumb", "images": [], "asset": "Bologna", "materials": {"baked": "Bologna_floor", "unbaked": "Bologna_floor_clean"}, "Specs": []}, {"_comment": "REMOVED: La Scala (ID 2) - References deleted T05LS texture files (T05LS_1.png through T05LS_7.png) that were deleted during asset optimization cleanup. These ~161MB of T-series texture files were removed to improve build times. Original La Scala floor data preserved for potential restoration when textures are re-added.", "id": 2, "name": "[TEMPORARILY DISABLED] La Scala", "description": "TEMPORARILY DISABLED: This floor item references deleted T05LS texture files that were removed during asset optimization to improve build times. Original description: Mostly, when we're chasing a sentiment, we are searching for our first love. Just like La Scala, it remains the most natural breath and genuine. The realist emotion from inside is presented in front of your eyes, and filterless freshness shines through your heart like spots of sunlight. The coloring process of this type of flooring is unique, using the reactive stain coloring technique, wood's natural colors and grains react differently to the water-based environment-friendly chemicals, such color variations represent wood's natural characteristics. The water-based UV Lacquer coating type provides great protection to the wood planks, it not only prevents the permeating of water moisture but is also more durable and environment-friendly.", "thumbnailUrl": "T05LS_thumb", "images": [], "asset": "La_Scala", "materials": {"baked": "La_Scala_floor", "unbaked": "La_Scala_floor_clean"}, "Specs": []}, {"_comment": "REMOVED: Lucca (ID 3) - References deleted T07LC texture files (T07LC_1.png through T07LC_7.png) that were deleted during asset optimization cleanup. These ~161MB of T-series texture files were removed to improve build times. Original Lucca floor data preserved for potential restoration when textures are re-added.", "id": 3, "name": "[TEMPORARILY DISABLED] Lucca", "description": "TEMPORARILY DISABLED: This floor item references deleted T07LC texture files that were removed during asset optimization to improve build times. Original description: This collection of flooring restores the most authentic characteristics of wood to the greatest extent, embodying a pursuit of authenticity and nature. It showcases a sense of freedom and a release of nature, allowing you to fully experience the beauty and power of the natural world. Moreover, this flooring line seamlessly blends with your home decor, infusing your living space with natural beauty and providing unparalleled comfort for you and your family.", "thumbnailUrl": "T07LC_thumb", "images": [], "asset": "Lucca", "materials": {"baked": "Lucca_floor", "unbaked": "Lucca_floor_clean"}, "Specs": []}, {"_comment": "REMOVED: Novara (ID 4) - References deleted T06NV texture files (T06NV_1.png through T06NV_7.png) that were deleted during asset optimization cleanup. These ~161MB of T-series texture files were removed to improve build times. Original Novara floor data preserved for potential restoration when textures are re-added.", "id": 4, "name": "[TEMPORARILY DISABLED] Novara", "description": "TEMPORARILY DISABLED: This floor item references deleted T06NV texture files that were removed during asset optimization to improve build times. Original description: This collection of flooring restores the most authentic characteristics of wood to the greatest extent, embodying a pursuit of authenticity and nature. It showcases a sense of freedom and a release of nature, allowing you to fully experience the beauty and power of the natural world. Moreover, this flooring line seamlessly blends with your home decor, infusing your living space with natural beauty and providing unparalleled comfort for you and your family.", "thumbnailUrl": "T06NV_thumb", "images": [], "asset": "Novara", "materials": {"baked": "Novara_floor", "unbaked": "Novara_floor_clean"}, "Specs": []}, {"_comment": "REMOVED: Palermo (ID 5) - References deleted T04PL texture files (T04PL_1.png through T04PL_7.png) that were deleted during asset optimization cleanup. These ~161MB of T-series texture files were removed to improve build times. Original Palermo floor data preserved for potential restoration when textures are re-added.", "id": 5, "name": "[TEMPORARILY DISABLED] Palermo", "description": "TEMPORARILY DISABLED: This floor item references deleted T04PL texture files that were removed during asset optimization to improve build times. Original description: A concealing language, with no complicated rhetorical vocabulary, wordless just like Mother Earth, but on the inside, it was colorful. Walking on earth feels like floating, deep brown intertwined with yellow-tan, the dark grains extend and stretch just like the valley, going through various mountains and rivers. The coloring process of this type of flooring is unique, using the reactive stain coloring technique, wood's natural colors and grains react differently to the water-based environment-friendly chemicals, such color variations represent wood's natural characteristics. The water-based UV Lacquer coating type provides great protection to the wood planks, it not only prevents the permeating of water moisture but is also more durable and environment-friendly.", "thumbnailUrl": "T04PL_thumb", "images": [], "asset": "Palermo", "materials": {"baked": "palermo_floor", "unbaked": "palermo_floor_clean"}, "Specs": []}, {"id": 6, "name": "Vicenza", "description": "Maybe it was just a blushing moment, maybe more distance is needed. A white yarn flutters above the cliff, accompanied by the wuthering of the wilderness blows. Suddenly, all of the unevenness turn into grains and textures, appearing on the wood planks. The story contains small rural villages, huge ruts, and the warmth of that stone fireplace. The coloring process of this type of flooring is unique, using the reactive stain coloring technique, wood's natural colors and grains react differently to the water-based environment-friendly chemicals, such color variations represent wood's natural characteristics. The water-based UV Lacquer coating type provides great protection to the wood planks, it not only prevents the permeating of water moisture but is also more durable and environment-friendly.", "thumbnailUrl": "Vicenza_thumb", "images": [{"order": 1, "url": "Vicenza-1.jpg"}, {"order": 2, "url": "Vicenza-2.jpg"}, {"order": 3, "url": "Vicenza-3.jpg"}, {"order": 4, "url": "Vicenza-4.jpg"}, {"order": 5, "url": "Vicenza-5.jpg"}, {"order": 6, "url": "Vicenza-6.jpg"}, {"order": 7, "url": "Vicenza-7.jpg"}], "asset": "Vicenza", "materials": {"baked": "Novara_floor", "unbaked": "Novara_floor_clean"}, "Specs": [{"module": "Materials", "icon": "materialIcon", "order": 1, "subs": [{"name": "Species", "desc": "European Oak", "position": 1}, {"name": "Grade", "desc": "Character", "position": 2}, {"name": "Core & Back", "desc": "Multilayer Plywood", "position": 3}, {"name": "Edges", "desc": "Micro-beveled", "position": 4}]}, {"module": "Craftmanship", "icon": "craftIcon", "order": 2, "subs": [{"name": "Finish/Coating", "desc": "Waterborne UV-Cured Coating", "position": 1}, {"name": "Coloring", "desc": "Reactive Stain", "position": 2}, {"name": "Treatment", "desc": "Chatter Marks", "position": 3}, {"name": "Installation Method", "desc": "Glue down, Nail + Glue, Floating", "position": 4}, {"name": "Profiling", "desc": "Tongue & Groove, beveled on long sides, micro-beveled on short sides", "position": 5}, {"name": "Adhesive", "desc": "Made with a formaldehyde-free adhesive (EPI);Product contains No Added Formaldehyde (NAF, NAUF);CARB ATCM Phase II Compliant (<0.05ppm formaldehyde)", "position": 6}]}, {"module": "Dimensions (Nominal)", "icon": "dimensionIcon", "order": 3, "subs": [{"name": "Length", "desc": "Up to 86 3/5\" R/L", "position": 1}, {"name": "Plank Width", "desc": "9 1/2\"", "position": 2}, {"name": "Wear Layer Thickness", "desc": "Actual: 3.5 mm\\n(Nominal: 4 mm)", "position": 3}, {"name": "Thickness", "desc": "3/4\"", "position": 4}]}]}, {"id": 7, "name": "Naples", "description": "You've probably heard of that harbor, where a weathered sailboat always docks. We're sailing under the afterglow of sunset, and drifting in the galaxy. If you are on board with us, a bowl of hot soup pairs perfectly with the candle lights, and a blanket will cover you from a long, chilled night. The coloring process of this type of flooring is unique, using the reactive stain coloring technique, wood's natural colors and grains react differently to the water-based environment-friendly chemicals, such color variations represent wood's natural characteristics. The water-based UV Lacquer coating type provides great protection to the wood planks, it not only prevents the permeating of water moisture but is also more durable and environment-friendly.", "thumbnailUrl": "Naples_thumb", "images": [{"order": 1, "url": "Naples-1.jpg"}, {"order": 2, "url": "Naples-2.jpg"}, {"order": 3, "url": "Naples-3.jpg"}, {"order": 4, "url": "Naples-4.jpg"}, {"order": 5, "url": "Naples-5.jpg"}, {"order": 6, "url": "Naples-6.jpg"}, {"order": 7, "url": "Naples-7.jpg"}], "asset": "Naples", "materials": {"baked": "Novara_floor", "unbaked": "Novara_floor_clean"}, "Specs": [{"module": "Materials", "icon": "materialIcon", "order": 1, "subs": [{"name": "Species", "desc": "European Oak", "position": 1}, {"name": "Grade", "desc": "Character", "position": 2}, {"name": "Core & Back", "desc": "Multilayer Plywood", "position": 3}, {"name": "Edges", "desc": "Micro-beveled", "position": 4}]}, {"module": "Craftmanship", "icon": "craftIcon", "order": 2, "subs": [{"name": "Finish/Coating", "desc": "Waterborne UV-Cured Coating", "position": 1}, {"name": "Coloring", "desc": "Reactive Stain", "position": 2}, {"name": "Treatment", "desc": "Chatter Marks", "position": 3}, {"name": "Installation Method", "desc": "Glue down, Nail + Glue, Floating", "position": 4}, {"name": "Profiling", "desc": "Tongue & Groove, beveled on long sides, micro-beveled on short sides", "position": 5}, {"name": "Adhesive", "desc": "Made with a formaldehyde-free adhesive (EPI);Product contains No Added Formaldehyde (NAF, NAUF);CARB ATCM Phase II Compliant (<0.05ppm formaldehyde)", "position": 6}]}, {"module": "Dimensions (Nominal)", "icon": "dimensionIcon", "order": 3, "subs": [{"name": "Length", "desc": "Up to 86 3/5\" R/L", "position": 1}, {"name": "Plank Width", "desc": "9 1/2\"", "position": 2}, {"name": "Wear Layer Thickness", "desc": "Actual: 3.5 mm\\n(Nominal: 4 mm)", "position": 3}, {"name": "Thickness", "desc": "3/4\"", "position": 4}]}]}]}]}
